---
kind: property
id: P:Autodesk.Revit.DB.TextNode.FontName
source: html/a5d65fa2-44e7-3c43-6a8e-f0c3dcb00799.htm
---
# Autodesk.Revit.DB.TextNode.FontName Property

The name of the text font.

## Syntax (C#)
```csharp
public string FontName { get; }
```